In [1]:
from github import Github
g=Github("priyanshu2411","priyanshu.krishnan")

In [2]:
for repo in g.get_user().get_repos():
#     print(repo.downloads_url)
    print(repo.html_url)

https://github.com/BewakoofData/311-nyc-data-
https://github.com/BewakoofData/awesome-courses
https://github.com/BewakoofData/awesome-courses-1
https://github.com/BewakoofData/awesome-datascience
https://github.com/BewakoofData/awesome-deep-learning
https://github.com/BewakoofData/Awesome-Hacking
https://github.com/BewakoofData/awesome-hadoop
https://github.com/BewakoofData/awesome-java
https://github.com/BewakoofData/awesome-machine-learning
https://github.com/BewakoofData/awesome-R
https://github.com/BewakoofData/awesome-rnn
https://github.com/BewakoofData/Blockchain-stuff
https://github.com/BewakoofData/caffe
https://github.com/BewakoofData/computer-science
https://github.com/BewakoofData/data-science
https://github.com/BewakoofData/Data-Science-45min-Intros
https://github.com/BewakoofData/DataScienceR
https://github.com/BewakoofData/DataScienceResources
https://github.com/BewakoofData/deeppy
https://github.com/BewakoofData/free-data-science-books
https://github.com/BewakoofData/free-programming-books
https://github.com/BewakoofData/hacktoberfest-projecteuler
https://github.com/BewakoofData/LearnDataScience
https://github.com/BewakoofData/Mocha.jl
https://github.com/BewakoofData/numpy-tutorial
https://github.com/BewakoofData/parallel_ml_tutorial
https://github.com/BewakoofData/pattern_classification
https://github.com/BewakoofData/Python-Learning-Resources
https://github.com/BewakoofData/readme
https://github.com/BewakoofData/SAS
https://github.com/BewakoofData/sas-prog-for-r-users
https://github.com/BewakoofData/scikit-learn
https://github.com/BewakoofData/SimpliLearn_ML
https://github.com/priyanshu2411/coderk3
https://github.com/priyanshu2411/data-science-handbook-practice
https://github.com/priyanshu2411/fosterphi.github.io
https://github.com/priyanshu2411/priyanshu2411.github.io
https://github.com/priyanshu2411/SimpliLearn_ML
https://github.com/priyanshu2411/UltraSonicSensor_Rpi2

In [3]:
import numpy as np
import pandas as pd
import seaborn as sb
import networkx as nx
import algorithms as al
titanic = sb.load_dataset('titanic')

In [26]:
from algorithms.sorting import bubble_sort as bu #pip install algorithms

In [27]:
bu.sort([2,3,4,5,2,1,2,9,8,5]) #playing with algorithms package

[1, 2, 2, 2, 3, 4, 5, 5, 8, 9]

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic.groupby('sex').mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [6]:
titanic.groupby('sex')[['survived','age']].mean()

        survived        age
sex
female  0.742038  27.915709
male    0.188908  30.726645

In [31]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [32]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [33]:
age = pd.cut(titanic['age'],[0,18,30,50,80])
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 30]  0.958333  0.900000  0.500000
       (30, 50]  0.972973  0.925926  0.272727
       (50, 80]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 30]  0.428571  0.027027  0.147541
       (30, 50]  0.448980  0.114286  0.126761
       (50, 80]  0.192308  0.083333  0.000000

In [34]:
fare = pd.qcut(titanic['fare'],2)
titanic.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 30]              NaN  0.916667  0.500000          0.958333
       (30, 50]              NaN  0.916667  0.142857          0.972973
       (50, 80]              NaN  0.000000  1.000000          1.000000
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 30]              NaN  0.040000  0.138889          0.428571
       (30, 50]              0.0  0.176471  0.118644          0.488889
       (50, 80]              NaN  0.111111  0.000000          0.192308

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 30]  0.888889  0.500000
       (30, 50]  0.933333  0.333333
       (50, 80]  1.000000       NaN
male   (0, 18]   0.818182  0.178571
       (18, 30]  0.000000  0.214286
       (30, 50]  0.055556  0.166667
       (50, 80]  0.000000       NaN

In [35]:
titanic.pivot_table(index='sex',columns='class',aggfunc= {'survived':sum,'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [36]:
titanic.pivot_table('survived',index='sex',columns='class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838